harviswang/linux-3.10.99/arch/mips/m200/inc/hw_gpio.h
//*****************************************************************************
//
// hw_gpio.h - Macros used when accessing the GPIO hardware.
//
// Copyright (c) 2017 Harvis Wang.  All rights reserved.
// Software License Agreement
// 
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
// 
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the  
//   distribution.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#ifndef __HW_GPIO_H__
#define __HW_GPIO_H__

//*****************************************************************************
//
// The following are defines for the GPIO register offsets.
//
//*****************************************************************************
#define GPIO_O_PIN              0x00000000  // PIN level register
#define GPIO_O_INT              0x00000010  // PIN interrupt register
#define GPIO_O_INTS             0x00000014  // PIN interrupt set register
#define GPIO_O_INTC             0x00000018  // PIN interrupt clear register
#define GPIO_O_MASK             0x00000020  // PIN interrupt mask register
#define GPIO_O_MASKS            0x00000024  // PIN interrupt mask set register
#define GPIO_O_MASKC            0x00000028  // PIN interrupt mask clear register
#define GPIO_O_PAT1             0x00000030  // PIN patten 1 register
#define GPIO_O_PAT1S            0x00000034  // PIN patten 1 set register
#define GPIO_O_PAT1C            0x00000038  // PIN patten 1 clear register
#define GPIO_O_PAT0             0x00000040  // PIN patten 0 register
#define GPIO_O_PAT0S            0x00000044  // PIN patten 0 set register
#define GPIO_O_PAT0C            0x00000048  // PIN patten 0 clear register
#define GPIO_O_FLAG             0x00000050  // PIN flag register
#define GPIO_O_FLAGC            0x00000058  // PIN flag clear register
#define GPIO_O_PEN              0x00000070  // PIN pull(down or up not both) disable register
#define GPIO_O_PENS             0x00000074  // PIN pull disable set register
#define GPIO_O_PENC             0x00000078  // PIN pull disable clear register
#define GPIO_O_PGZIDLD          0x000000B0  // Group ID to be load
#define GPIO_O_PZACFG0          0x000000C0  // Glitch filter configure register 0 for port PA
#define GPIO_O_PZBCFG0          0x000000D0  // Glitch filter configure register 0 for port PB
#define GPIO_O_PZCCFG0          0x000000E0  // Glitch filter configure register 0 for port PC
#define GPIO_O_PZDCFG0          0x000000F0  // Glitch filter configure register 0 for port PD
#define GPIO_O_PZECFG0          0x0000000C  // Glitch filter configure register 0 for port PE
#define GPIO_O_PZFCFG0          0x0000004C  // Glitch filter configure register 0 for port PF

#define GPIO_O_PZACFG1          0x000000C4  // Glitch filter configure register 1 for port PA
#define GPIO_O_PZBCFG1          0x000000D4  // Glitch filter configure register 1 for port PB
#define GPIO_O_PZCCFG1          0x000000E4  // Glitch filter configure register 1 for port PC
#define GPIO_O_PZDCFG1          0x000000F4  // Glitch filter configure register 1 for port PD
#define GPIO_O_PZECFG1          0x0000001C  // Glitch filter configure register 1 for port PE
#define GPIO_O_PZFCFG1          0x0000005C  // Glitch filter configure register 1 for port PF

#define GPIO_O_PZACFG2          0x000000C8  // Glitch filter configure register 2 for port PA
#define GPIO_O_PZBCFG2          0x000000D8  // Glitch filter configure register 2 for port PB
#define GPIO_O_PZCCFG2          0x000000E8  // Glitch filter configure register 2 for port PC
#define GPIO_O_PZDCFG2          0x000000F8  // Glitch filter configure register 2 for port PD
#define GPIO_O_PZECFG2          0x0000002C  // Glitch filter configure register 2 for port PE
#define GPIO_O_PZFCFG2          0x0000006C  // Glitch filter configure register 2 for port PF

#define GPIO_O_PZACFG3          0x000000CC  // Glitch filter configure register 3 for port PA
#define GPIO_O_PZBCFG3          0x000000DC  // Glitch filter configure register 3 for port PB
#define GPIO_O_PZCCFG3          0x000000EC  // Glitch filter configure register 3 for port PC
#define GPIO_O_PZDCFG3          0x000000FC  // Glitch filter configure register 3 for port PD
#define GPIO_O_PZECFG3          0x0000003C  // Glitch filter configure register 3 for port PE
#define GPIO_O_PZFCFG3          0x0000007C  // Glitch filter configure register 3 for port PF



//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PIN register.
//
//*****************************************************************************
#define GPIO_PIN_PNL31          0x80000000  // 31 PIN level
                                            // 0: Corresponding pin voltage level is low
                                            // 1: Corresponding pin voltage level is high
#define GPIO_PIN_PNL30          0x40000000  // 30 PIN level
#define GPIO_PIN_PNL29          0x20000000  // 29 PIN level
#define GPIO_PIN_PNL28          0x10000000  // 28 PIN level
#define GPIO_PIN_PNL27          0x08000000  // 27 PIN level
#define GPIO_PIN_PNL26          0x04000000  // 26 PIN level
#define GPIO_PIN_PNL25          0x02000000  // 25 PIN level
#define GPIO_PIN_PNL24          0x01000000  // 24 PIN level
#define GPIO_PIN_PNL23          0x00800000  // 23 PIN level
#define GPIO_PIN_PNL22          0x00400000  // 22 PIN level
#define GPIO_PIN_PNL21          0x00200000  // 21 PIN level
#define GPIO_PIN_PNL20          0x00100000  // 20 PIN level
#define GPIO_PIN_PNL19          0x00080000  // 19 PIN level
#define GPIO_PIN_PNL18          0x00040000  // 18 PIN level
#define GPIO_PIN_PNL17          0x00020000  // 17 PIN level
#define GPIO_PIN_PNL16          0x00010000  // 16 PIN level
#define GPIO_PIN_PNL15          0x00008000  // 15 PIN level
#define GPIO_PIN_PNL14          0x00004000  // 14 PIN level
#define GPIO_PIN_PNL13          0x00002000  // 13 PIN level
#define GPIO_PIN_PNL12          0x00001000  // 12 PIN level
#define GPIO_PIN_PNL11          0x00000800  // 11 PIN level
#define GPIO_PIN_PNL10          0x00000400  // 10 PIN level
#define GPIO_PIN_PNL9           0x00000200  // 9 PIN level
#define GPIO_PIN_PNL8           0x00000100  // 8 PIN level
#define GPIO_PIN_PNL7           0x00000080  // 7 PIN level
#define GPIO_PIN_PNL6           0x00000040  // 6 PIN level
#define GPIO_PIN_PNL5           0x00000020  // 5 PIN level
#define GPIO_PIN_PNL4           0x00000010  // 4 PIN level
#define GPIO_PIN_PNL3           0x00000008  // 3 PIN level
#define GPIO_PIN_PNL2           0x00000004  // 2 PIN level
#define GPIO_PIN_PNL1           0x00000002  // 1 PIN level
#define GPIO_PIN_PNL0           0x00000001  // 0 PIN level

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_INT register.
//
//*****************************************************************************
#define GPIO_INT_INT31          0x80000000  // 31 Interrupt enable
                                            // 0: Corresponding pin is used as device functions or normal gpio
                                            // 1: Corresponding pin is used as interrupt
#define GPIO_INT_INT30          0x40000000  // 30 Interrupt enable
#define GPIO_INT_INT29          0x20000000  // 29 Interrupt enable
#define GPIO_INT_INT28          0x10000000  // 28 Interrupt enable
#define GPIO_INT_INT27          0x08000000  // 27 Interrupt enable
#define GPIO_INT_INT26          0x04000000  // 26 Interrupt enable
#define GPIO_INT_INT25          0x02000000  // 25 Interrupt enable
#define GPIO_INT_INT24          0x01000000  // 24 Interrupt enable
#define GPIO_INT_INT23          0x00800000  // 23 Interrupt enable
#define GPIO_INT_INT22          0x00400000  // 22 Interrupt enable
#define GPIO_INT_INT21          0x00200000  // 21 Interrupt enable
#define GPIO_INT_INT20          0x00100000  // 20 Interrupt enable
#define GPIO_INT_INT19          0x00080000  // 19 Interrupt enable
#define GPIO_INT_INT18          0x00040000  // 18 Interrupt enable
#define GPIO_INT_INT17          0x00020000  // 17 Interrupt enable
#define GPIO_INT_INT16          0x00010000  // 16 Interrupt enable
#define GPIO_INT_INT15          0x00008000  // 15 Interrupt enable
#define GPIO_INT_INT14          0x00004000  // 14 Interrupt enable
#define GPIO_INT_INT13          0x00002000  // 13 Interrupt enable
#define GPIO_INT_INT12          0x00001000  // 12 Interrupt enable
#define GPIO_INT_INT11          0x00000800  // 11 Interrupt enable
#define GPIO_INT_INT10          0x00000400  // 10 Interrupt enable
#define GPIO_INT_INT9           0x00000200  // 9 Interrupt enable
#define GPIO_INT_INT8           0x00000100  // 8 Interrupt enable
#define GPIO_INT_INT7           0x00000080  // 7 Interrupt enable
#define GPIO_INT_INT6           0x00000040  // 6 Interrupt enable
#define GPIO_INT_INT5           0x00000020  // 5 Interrupt enable
#define GPIO_INT_INT4           0x00000010  // 4 Interrupt enable
#define GPIO_INT_INT3           0x00000008  // 3 Interrupt enable
#define GPIO_INT_INT2           0x00000004  // 2 Interrupt enable
#define GPIO_INT_INT1           0x00000002  // 1 Interrupt enable
#define GPIO_INT_INT0           0x00000001  // 0 Interrupt enable

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_INTS register.
//
//*****************************************************************************
#define GPIO_INTS_INTS31        0x80000000  // 31 Interrupt enable set
#define GPIO_INTS_INTS30        0x40000000  // 30 Interrupt enable set
#define GPIO_INTS_INTS29        0x20000000  // 29 Interrupt enable set
#define GPIO_INTS_INTS28        0x10000000  // 28 Interrupt enable set
#define GPIO_INTS_INTS27        0x08000000  // 27 Interrupt enable set
#define GPIO_INTS_INTS26        0x04000000  // 26 Interrupt enable set
#define GPIO_INTS_INTS25        0x02000000  // 25 Interrupt enable set
#define GPIO_INTS_INTS24        0x01000000  // 24 Interrupt enable set
#define GPIO_INTS_INTS23        0x00800000  // 23 Interrupt enable set
#define GPIO_INTS_INTS22        0x00400000  // 22 Interrupt enable set
#define GPIO_INTS_INTS21        0x00200000  // 21 Interrupt enable set
#define GPIO_INTS_INTS20        0x00100000  // 20 Interrupt enable set
#define GPIO_INTS_INTS19        0x00080000  // 19 Interrupt enable set
#define GPIO_INTS_INTS18        0x00040000  // 18 Interrupt enable set
#define GPIO_INTS_INTS17        0x00020000  // 17 Interrupt enable set
#define GPIO_INTS_INTS16        0x00010000  // 16 Interrupt enable set
#define GPIO_INTS_INTS15        0x00008000  // 15 Interrupt enable set
#define GPIO_INTS_INTS14        0x00004000  // 14 Interrupt enable set
#define GPIO_INTS_INTS13        0x00002000  // 13 Interrupt enable set
#define GPIO_INTS_INTS12        0x00001000  // 12 Interrupt enable set
#define GPIO_INTS_INTS11        0x00000800  // 11 Interrupt enable set
#define GPIO_INTS_INTS10        0x00000400  // 10 Interrupt enable set
#define GPIO_INTS_INTS9         0x00000200  // 9 Interrupt enable set
#define GPIO_INTS_INTS8         0x00000100  // 8 Interrupt enable set
#define GPIO_INTS_INTS7         0x00000080  // 7 Interrupt enable set
#define GPIO_INTS_INTS6         0x00000040  // 6 Interrupt enable set
#define GPIO_INTS_INTS5         0x00000020  // 5 Interrupt enable set
#define GPIO_INTS_INTS4         0x00000010  // 4 Interrupt enable set
#define GPIO_INTS_INTS3         0x00000008  // 3 Interrupt enable set
#define GPIO_INTS_INTS2         0x00000004  // 2 Interrupt enable set
#define GPIO_INTS_INTS1         0x00000002  // 1 Interrupt enable set
#define GPIO_INTS_INTS0         0x00000001  // 0 Interrupt enable set

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_INTC register.
//
//*****************************************************************************
#define GPIO_INTC_INTC31        0x80000000  // 31 Interrupt enable clear
#define GPIO_INTC_INTC30        0x40000000  // 30 Interrupt enable clear
#define GPIO_INTC_INTC29        0x20000000  // 29 Interrupt enable clear
#define GPIO_INTC_INTC28        0x10000000  // 28 Interrupt enable clear
#define GPIO_INTC_INTC27        0x08000000  // 27 Interrupt enable clear
#define GPIO_INTC_INTC26        0x04000000  // 26 Interrupt enable clear
#define GPIO_INTC_INTC25        0x02000000  // 25 Interrupt enable clear
#define GPIO_INTC_INTC24        0x01000000  // 24 Interrupt enable clear
#define GPIO_INTC_INTC23        0x00800000  // 23 Interrupt enable clear
#define GPIO_INTC_INTC22        0x00400000  // 22 Interrupt enable clear
#define GPIO_INTC_INTC21        0x00200000  // 21 Interrupt enable clear
#define GPIO_INTC_INTC20        0x00100000  // 20 Interrupt enable clear
#define GPIO_INTC_INTC19        0x00080000  // 19 Interrupt enable clear
#define GPIO_INTC_INTC18        0x00040000  // 18 Interrupt enable clear
#define GPIO_INTC_INTC17        0x00020000  // 17 Interrupt enable clear
#define GPIO_INTC_INTC16        0x00010000  // 16 Interrupt enable clear
#define GPIO_INTC_INTC15        0x00008000  // 15 Interrupt enable clear
#define GPIO_INTC_INTC14        0x00004000  // 14 Interrupt enable clear
#define GPIO_INTC_INTC13        0x00002000  // 13 Interrupt enable clear
#define GPIO_INTC_INTC12        0x00001000  // 12 Interrupt enable clear
#define GPIO_INTC_INTC11        0x00000800  // 11 Interrupt enable clear
#define GPIO_INTC_INTC10        0x00000400  // 10 Interrupt enable clear
#define GPIO_INTC_INTC9         0x00000200  // 9 Interrupt enable clear
#define GPIO_INTC_INTC8         0x00000100  // 8 Interrupt enable clear
#define GPIO_INTC_INTC7         0x00000080  // 7 Interrupt enable clear
#define GPIO_INTC_INTC6         0x00000040  // 6 Interrupt enable clear
#define GPIO_INTC_INTC5         0x00000020  // 5 Interrupt enable clear
#define GPIO_INTC_INTC4         0x00000010  // 4 Interrupt enable clear
#define GPIO_INTC_INTC3         0x00000008  // 3 Interrupt enable clear
#define GPIO_INTC_INTC2         0x00000004  // 2 Interrupt enable clear
#define GPIO_INTC_INTC1         0x00000002  // 1 Interrupt enable clear
#define GPIO_INTC_INTC0         0x00000001  // 0 Interrupt enable clear

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_MASK register.
// When GPIO_INT_XXX=1
// 0: Enable interrupt function
// 1: Disable interrupt function or
// When GPIO_INT_XXX=0
// 0: Enable device function
// 1: Disable device function, as normal gpio
//
//*****************************************************************************
#define GPIO_MASK_MASK31        0x80000000  // 31 PIN function mask
#define GPIO_MASK_MASK30        0x40000000  // 30 PIN function mask
#define GPIO_MASK_MASK29        0x20000000  // 29 PIN function mask
#define GPIO_MASK_MASK28        0x10000000  // 28 PIN function mask
#define GPIO_MASK_MASK27        0x08000000  // 27 PIN function mask
#define GPIO_MASK_MASK26        0x04000000  // 26 PIN function mask
#define GPIO_MASK_MASK25        0x02000000  // 25 PIN function mask
#define GPIO_MASK_MASK24        0x01000000  // 24 PIN function mask
#define GPIO_MASK_MASK23        0x00800000  // 23 PIN function mask
#define GPIO_MASK_MASK22        0x00400000  // 22 PIN function mask
#define GPIO_MASK_MASK21        0x00200000  // 21 PIN function mask
#define GPIO_MASK_MASK20        0x00100000  // 20 PIN function mask
#define GPIO_MASK_MASK19        0x00080000  // 19 PIN function mask
#define GPIO_MASK_MASK18        0x00040000  // 18 PIN function mask
#define GPIO_MASK_MASK17        0x00020000  // 17 PIN function mask
#define GPIO_MASK_MASK16        0x00010000  // 16 PIN function mask
#define GPIO_MASK_MASK15        0x00008000  // 15 PIN function mask
#define GPIO_MASK_MASK14        0x00004000  // 14 PIN function mask
#define GPIO_MASK_MASK13        0x00002000  // 13 PIN function mask
#define GPIO_MASK_MASK12        0x00001000  // 12 PIN function mask
#define GPIO_MASK_MASK11        0x00000800  // 11 PIN function mask
#define GPIO_MASK_MASK10        0x00000400  // 10 PIN function mask
#define GPIO_MASK_MASK9         0x00000200  // 9 PIN function mask
#define GPIO_MASK_MASK8         0x00000100  // 8 PIN function mask
#define GPIO_MASK_MASK7         0x00000080  // 7 PIN function mask
#define GPIO_MASK_MASK6         0x00000040  // 6 PIN function mask
#define GPIO_MASK_MASK5         0x00000020  // 5 PIN function mask
#define GPIO_MASK_MASK4         0x00000010  // 4 PIN function mask
#define GPIO_MASK_MASK3         0x00000008  // 3 PIN function mask
#define GPIO_MASK_MASK2         0x00000004  // 2 PIN function mask
#define GPIO_MASK_MASK1         0x00000002  // 1 PIN function mask
#define GPIO_MASK_MASK0         0x00000001  // 0 PIN function mask

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_MASKS register.
//
//*****************************************************************************
#define GPIO_MASKS_MASKS31      0x80000000  // 31 PIN function mask set
#define GPIO_MASKS_MASKS30      0x40000000  // 30 PIN function mask set
#define GPIO_MASKS_MASKS29      0x20000000  // 29 PIN function mask set
#define GPIO_MASKS_MASKS28      0x10000000  // 28 PIN function mask set
#define GPIO_MASKS_MASKS27      0x08000000  // 27 PIN function mask set
#define GPIO_MASKS_MASKS26      0x04000000  // 26 PIN function mask set
#define GPIO_MASKS_MASKS25      0x02000000  // 25 PIN function mask set
#define GPIO_MASKS_MASKS24      0x01000000  // 24 PIN function mask set
#define GPIO_MASKS_MASKS23      0x00800000  // 23 PIN function mask set
#define GPIO_MASKS_MASKS22      0x00400000  // 22 PIN function mask set
#define GPIO_MASKS_MASKS21      0x00200000  // 21 PIN function mask set
#define GPIO_MASKS_MASKS20      0x00100000  // 20 PIN function mask set
#define GPIO_MASKS_MASKS19      0x00080000  // 19 PIN function mask set
#define GPIO_MASKS_MASKS18      0x00040000  // 18 PIN function mask set
#define GPIO_MASKS_MASKS17      0x00020000  // 17 PIN function mask set
#define GPIO_MASKS_MASKS16      0x00010000  // 16 PIN function mask set
#define GPIO_MASKS_MASKS15      0x00008000  // 15 PIN function mask set
#define GPIO_MASKS_MASKS14      0x00004000  // 14 PIN function mask set
#define GPIO_MASKS_MASKS13      0x00002000  // 13 PIN function mask set
#define GPIO_MASKS_MASKS12      0x00001000  // 12 PIN function mask set
#define GPIO_MASKS_MASKS11      0x00000800  // 11 PIN function mask set
#define GPIO_MASKS_MASKS10      0x00000400  // 10 PIN function mask set
#define GPIO_MASKS_MASKS9       0x00000200  // 9 PIN function mask set
#define GPIO_MASKS_MASKS8       0x00000100  // 8 PIN function mask set
#define GPIO_MASKS_MASKS7       0x00000080  // 7 PIN function mask set
#define GPIO_MASKS_MASKS6       0x00000040  // 6 PIN function mask set
#define GPIO_MASKS_MASKS5       0x00000020  // 5 PIN function mask set
#define GPIO_MASKS_MASKS4       0x00000010  // 4 PIN function mask set
#define GPIO_MASKS_MASKS3       0x00000008  // 3 PIN function mask set
#define GPIO_MASKS_MASKS2       0x00000004  // 2 PIN function mask set
#define GPIO_MASKS_MASKS1       0x00000002  // 1 PIN function mask set
#define GPIO_MASKS_MASKS0       0x00000001  // 0 PIN function mask set

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_MASKC register.
//
//*****************************************************************************
#define GPIO_MASKC_MASKC31      0x80000000  // 31 PIN function mask clear
#define GPIO_MASKC_MASKC30      0x40000000  // 30 PIN function mask clear
#define GPIO_MASKC_MASKC29      0x20000000  // 29 PIN function mask clear
#define GPIO_MASKC_MASKC28      0x10000000  // 28 PIN function mask clear
#define GPIO_MASKC_MASKC27      0x08000000  // 27 PIN function mask clear
#define GPIO_MASKC_MASKC26      0x04000000  // 26 PIN function mask clear
#define GPIO_MASKC_MASKC25      0x02000000  // 25 PIN function mask clear
#define GPIO_MASKC_MASKC24      0x01000000  // 24 PIN function mask clear
#define GPIO_MASKC_MASKC23      0x00800000  // 23 PIN function mask clear
#define GPIO_MASKC_MASKC22      0x00400000  // 22 PIN function mask clear
#define GPIO_MASKC_MASKC21      0x00200000  // 21 PIN function mask clear
#define GPIO_MASKC_MASKC20      0x00100000  // 20 PIN function mask clear
#define GPIO_MASKC_MASKC19      0x00080000  // 19 PIN function mask clear
#define GPIO_MASKC_MASKC18      0x00040000  // 18 PIN function mask clear
#define GPIO_MASKC_MASKC17      0x00020000  // 17 PIN function mask clear
#define GPIO_MASKC_MASKC16      0x00010000  // 16 PIN function mask clear
#define GPIO_MASKC_MASKC15      0x00008000  // 15 PIN function mask clear
#define GPIO_MASKC_MASKC14      0x00004000  // 14 PIN function mask clear
#define GPIO_MASKC_MASKC13      0x00002000  // 13 PIN function mask clear
#define GPIO_MASKC_MASKC12      0x00001000  // 12 PIN function mask clear
#define GPIO_MASKC_MASKC11      0x00000800  // 11 PIN function mask clear
#define GPIO_MASKC_MASKC10      0x00000400  // 10 PIN function mask clear
#define GPIO_MASKC_MASKC9       0x00000200  // 9 PIN function mask clear
#define GPIO_MASKC_MASKC8       0x00000100  // 8 PIN function mask clear
#define GPIO_MASKC_MASKC7       0x00000080  // 7 PIN function mask clear
#define GPIO_MASKC_MASKC6       0x00000040  // 6 PIN function mask clear
#define GPIO_MASKC_MASKC5       0x00000020  // 5 PIN function mask clear
#define GPIO_MASKC_MASKC4       0x00000010  // 4 PIN function mask clear
#define GPIO_MASKC_MASKC3       0x00000008  // 3 PIN function mask clear
#define GPIO_MASKC_MASKC2       0x00000004  // 2 PIN function mask clear
#define GPIO_MASKC_MASKC1       0x00000002  // 1 PIN function mask clear
#define GPIO_MASKC_MASKC0       0x00000001  // 0 PIN function mask clear

