harviswang/linux-3.10.99/arch/mips/m200/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PAT1 register.
// When GPIO_INT_XXX=1
// 0: Level trigger interrupt function
// 1: Edge trigger interrupt function
// When GPIO_INT_XXX=0 and GPIO_MASK_XXX=0
// 0: Corresponding pin is used as device 0 or device 1 function
// 1: Corresponding pin is used as device 2 or device 3 function
// When GPIO_INT_XXX=0 and GPIO_MASK_XXX=1
// 0: Corresponding pin is used as gpio output
// 1: Corresponding pin is used as gpio input
//*****************************************************************************
#define GPIO_PAT1_PAT131        0x80000000  // 31 PIN pattern 1 status
#define GPIO_PAT1_PAT130        0x40000000  // 30 PIN pattern 1 status
#define GPIO_PAT1_PAT129        0x20000000  // 29 PIN pattern 1 status
#define GPIO_PAT1_PAT128        0x10000000  // 28 PIN pattern 1 status
#define GPIO_PAT1_PAT127        0x08000000  // 27 PIN pattern 1 status
#define GPIO_PAT1_PAT126        0x04000000  // 26 PIN pattern 1 status
#define GPIO_PAT1_PAT125        0x02000000  // 25 PIN pattern 1 status
#define GPIO_PAT1_PAT124        0x01000000  // 24 PIN pattern 1 status
#define GPIO_PAT1_PAT123        0x00800000  // 23 PIN pattern 1 status
#define GPIO_PAT1_PAT122        0x00400000  // 22 PIN pattern 1 status
#define GPIO_PAT1_PAT121        0x00200000  // 21 PIN pattern 1 status
#define GPIO_PAT1_PAT120        0x00100000  // 20 PIN pattern 1 status
#define GPIO_PAT1_PAT119        0x00080000  // 19 PIN pattern 1 status
#define GPIO_PAT1_PAT118        0x00040000  // 18 PIN pattern 1 status
#define GPIO_PAT1_PAT117        0x00020000  // 17 PIN pattern 1 status
#define GPIO_PAT1_PAT116        0x00010000  // 16 PIN pattern 1 status
#define GPIO_PAT1_PAT115        0x00008000  // 15 PIN pattern 1 status
#define GPIO_PAT1_PAT114        0x00004000  // 14 PIN pattern 1 status
#define GPIO_PAT1_PAT113        0x00002000  // 13 PIN pattern 1 status
#define GPIO_PAT1_PAT112        0x00001000  // 12 PIN pattern 1 status
#define GPIO_PAT1_PAT111        0x00000800  // 11 PIN pattern 1 status
#define GPIO_PAT1_PAT110        0x00000400  // 10 PIN pattern 1 status
#define GPIO_PAT1_PAT19         0x00000200  // 9 PIN pattern 1 status
#define GPIO_PAT1_PAT18         0x00000100  // 8 PIN pattern 1 status
#define GPIO_PAT1_PAT17         0x00000080  // 7 PIN pattern 1 status
#define GPIO_PAT1_PAT16         0x00000040  // 6 PIN pattern 1 status
#define GPIO_PAT1_PAT15         0x00000020  // 5 PIN pattern 1 status
#define GPIO_PAT1_PAT14         0x00000010  // 4 PIN pattern 1 status
#define GPIO_PAT1_PAT13         0x00000008  // 3 PIN pattern 1 status
#define GPIO_PAT1_PAT12         0x00000004  // 2 PIN pattern 1 status
#define GPIO_PAT1_PAT11         0x00000002  // 1 PIN pattern 1 status
#define GPIO_PAT1_PAT10         0x00000001  // 0 PIN pattern 1 status

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PAT1S register.
//
//*****************************************************************************
#define GPIO_PAT1S_PAT1S31      0x80000000  // 31 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S30      0x40000000  // 30 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S29      0x20000000  // 29 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S28      0x10000000  // 28 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S27      0x08000000  // 27 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S26      0x04000000  // 26 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S25      0x02000000  // 25 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S24      0x01000000  // 24 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S23      0x00800000  // 23 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S22      0x00400000  // 22 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S21      0x00200000  // 21 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S20      0x00100000  // 20 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S19      0x00080000  // 19 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S18      0x00040000  // 18 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S17      0x00020000  // 17 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S16      0x00010000  // 16 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S15      0x00008000  // 15 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S14      0x00004000  // 14 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S13      0x00002000  // 13 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S12      0x00001000  // 12 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S11      0x00000800  // 11 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S10      0x00000400  // 10 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S9       0x00000200  // 9 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S8       0x00000100  // 8 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S7       0x00000080  // 7 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S6       0x00000040  // 6 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S5       0x00000020  // 5 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S4       0x00000010  // 4 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S3       0x00000008  // 3 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S2       0x00000004  // 2 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S1       0x00000002  // 1 PIN pattern 1 config set
#define GPIO_PAT1S_PAT1S0       0x00000001  // 0 PIN pattern 1 config set

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PAT1C register.
//
//*****************************************************************************
#define GPIO_PAT1C_PAT1C31      0x80000000  // 31 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C30      0x40000000  // 30 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C29      0x20000000  // 29 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C28      0x10000000  // 28 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C27      0x08000000  // 27 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C26      0x04000000  // 26 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C25      0x02000000  // 25 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C24      0x01000000  // 24 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C23      0x00800000  // 23 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C22      0x00400000  // 22 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C21      0x00200000  // 21 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C20      0x00100000  // 20 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C19      0x00080000  // 19 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C18      0x00040000  // 18 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C17      0x00020000  // 17 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C16      0x00010000  // 16 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C15      0x00008000  // 15 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C14      0x00004000  // 14 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C13      0x00002000  // 13 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C12      0x00001000  // 12 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C11      0x00000800  // 11 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C10      0x00000400  // 10 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C9       0x00000200  // 9 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C8       0x00000100  // 8 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C7       0x00000080  // 7 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C6       0x00000040  // 6 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C5       0x00000020  // 5 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C4       0x00000010  // 4 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C3       0x00000008  // 3 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C2       0x00000004  // 2 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C1       0x00000002  // 1 PIN pattern 1 config clear
#define GPIO_PAT1C_PAT1C0       0x00000001  // 0 PIN pattern 1 config clear

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PAT0 register.
// When GPIO_INT_XXX=1 and GPIO_PAT1_XXX=0
// 0: Pin is low level interrupt input
// 1: Pin is high level interrupt input
// When GPIO_INT_XXX=1 and GPIO_PAT1_XXX=1
// 0: Pin is falling edge triggered interrupt input
// 1: Pin is rising edge triggered interrupt input
// When GPIO_INT_XXX=0 and GPIO_MASK_XXX=0 and GPIO_PAT1_XXX=0
// 0: Pin is used as device 0 function
// 1: Pin is used as device 1 function
// When GPIO_INT_XXX=0 and GPIO_MASK_XXX=0 and GPIO_PAT1_XXX=1
// 0: Corresponding pin is used as device 2 function
// 1: Corresponding pin is used as device 3 function
// When GPIO_INT_XXX=0 and GPIO_MASK_XXX=1 and GPIO_PAT1_XXX=0
// 0: Corresponding pin is used as gpio output 0
// 1: Corresponding pin is used as gpio output 1
//*****************************************************************************
#define GPIO_PAT0_PAT031        0x80000000  // 31 PIN pattern 0 config
#define GPIO_PAT0_PAT030        0x40000000  // 30 PIN pattern 0 config
#define GPIO_PAT0_PAT029        0x20000000  // 29 PIN pattern 0 config
#define GPIO_PAT0_PAT028        0x10000000  // 28 PIN pattern 0 config
#define GPIO_PAT0_PAT027        0x08000000  // 27 PIN pattern 0 config
#define GPIO_PAT0_PAT026        0x04000000  // 26 PIN pattern 0 config
#define GPIO_PAT0_PAT025        0x02000000  // 25 PIN pattern 0 config
#define GPIO_PAT0_PAT024        0x01000000  // 24 PIN pattern 0 config
#define GPIO_PAT0_PAT023        0x00800000  // 23 PIN pattern 0 config
#define GPIO_PAT0_PAT022        0x00400000  // 22 PIN pattern 0 config
#define GPIO_PAT0_PAT021        0x00200000  // 21 PIN pattern 0 config
#define GPIO_PAT0_PAT020        0x00100000  // 20 PIN pattern 0 config
#define GPIO_PAT0_PAT019        0x00080000  // 19 PIN pattern 0 config
#define GPIO_PAT0_PAT018        0x00040000  // 18 PIN pattern 0 config
#define GPIO_PAT0_PAT017        0x00020000  // 17 PIN pattern 0 config
#define GPIO_PAT0_PAT016        0x00010000  // 16 PIN pattern 0 config
#define GPIO_PAT0_PAT015        0x00008000  // 15 PIN pattern 0 config
#define GPIO_PAT0_PAT014        0x00004000  // 14 PIN pattern 0 config
#define GPIO_PAT0_PAT013        0x00002000  // 13 PIN pattern 0 config
#define GPIO_PAT0_PAT012        0x00001000  // 12 PIN pattern 0 config
#define GPIO_PAT0_PAT011        0x00000800  // 11 PIN pattern 0 config
#define GPIO_PAT0_PAT010        0x00000400  // 10 PIN pattern 0 config
#define GPIO_PAT0_PAT09         0x00000200  // 9 PIN pattern 0 config
#define GPIO_PAT0_PAT08         0x00000100  // 8 PIN pattern 0 config
#define GPIO_PAT0_PAT07         0x00000080  // 7 PIN pattern 0 config
#define GPIO_PAT0_PAT06         0x00000040  // 6 PIN pattern 0 config
#define GPIO_PAT0_PAT05         0x00000020  // 5 PIN pattern 0 config
#define GPIO_PAT0_PAT04         0x00000010  // 4 PIN pattern 0 config
#define GPIO_PAT0_PAT03         0x00000008  // 3 PIN pattern 0 config
#define GPIO_PAT0_PAT02         0x00000004  // 2 PIN pattern 0 config
#define GPIO_PAT0_PAT01         0x00000002  // 1 PIN pattern 0 config
#define GPIO_PAT0_PAT00         0x00000001  // 0 PIN pattern 0 config

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PAT0S register.
//
//*****************************************************************************
#define GPIO_PAT0S_PAT0S31      0x80000000  // 31 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S30      0x40000000  // 30 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S29      0x20000000  // 29 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S28      0x10000000  // 28 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S27      0x08000000  // 27 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S26      0x04000000  // 26 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S25      0x02000000  // 25 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S24      0x01000000  // 24 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S23      0x00800000  // 23 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S22      0x00400000  // 22 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S21      0x00200000  // 21 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S20      0x00100000  // 20 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S19      0x00080000  // 19 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S18      0x00040000  // 18 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S17      0x00020000  // 17 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S16      0x00010000  // 16 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S15      0x00008000  // 15 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S14      0x00004000  // 14 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S13      0x00002000  // 13 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S12      0x00001000  // 12 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S11      0x00000800  // 11 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S10      0x00000400  // 10 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S9       0x00000200  // 9 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S8       0x00000100  // 8 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S7       0x00000080  // 7 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S6       0x00000040  // 6 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S5       0x00000020  // 5 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S4       0x00000010  // 4 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S3       0x00000008  // 3 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S2       0x00000004  // 2 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S1       0x00000002  // 1 PIN pattern 0 config set
#define GPIO_PAT0S_PAT0S0       0x00000001  // 0 PIN pattern 0 config set

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PAT0C register.
//
//*****************************************************************************
#define GPIO_PAT0C_PAT0C31      0x80000000  // 31 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C30      0x40000000  // 30 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C29      0x20000000  // 29 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C28      0x10000000  // 28 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C27      0x08000000  // 27 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C26      0x04000000  // 26 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C25      0x02000000  // 25 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C24      0x01000000  // 24 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C23      0x00800000  // 23 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C22      0x00400000  // 22 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C21      0x00200000  // 21 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C20      0x00100000  // 20 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C19      0x00080000  // 19 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C18      0x00040000  // 18 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C17      0x00020000  // 17 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C16      0x00010000  // 16 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C15      0x00008000  // 15 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C14      0x00004000  // 14 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C13      0x00002000  // 13 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C12      0x00001000  // 12 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C11      0x00000800  // 11 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C10      0x00000400  // 10 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C9       0x00000200  // 9 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C8       0x00000100  // 8 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C7       0x00000080  // 7 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C6       0x00000040  // 6 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C5       0x00000020  // 5 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C4       0x00000010  // 4 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C3       0x00000008  // 3 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C2       0x00000004  // 2 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C1       0x00000002  // 1 PIN pattern 0 config clear
#define GPIO_PAT0C_PAT0C0       0x00000001  // 0 PIN pattern 0 config clear

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_FLAG register.
//
//*****************************************************************************
#define GPIO_FLAG_FLAG31        0x80000000  // 31 PIN interrupt flag bit
#define GPIO_FLAG_FLAG30        0x40000000  // 30 PIN interrupt flag bit
#define GPIO_FLAG_FLAG29        0x20000000  // 29 PIN interrupt flag bit
#define GPIO_FLAG_FLAG28        0x10000000  // 28 PIN interrupt flag bit
#define GPIO_FLAG_FLAG27        0x08000000  // 27 PIN interrupt flag bit
#define GPIO_FLAG_FLAG26        0x04000000  // 26 PIN interrupt flag bit
#define GPIO_FLAG_FLAG25        0x02000000  // 25 PIN interrupt flag bit
#define GPIO_FLAG_FLAG24        0x01000000  // 24 PIN interrupt flag bit
#define GPIO_FLAG_FLAG23        0x00800000  // 23 PIN interrupt flag bit
#define GPIO_FLAG_FLAG22        0x00400000  // 22 PIN interrupt flag bit
#define GPIO_FLAG_FLAG21        0x00200000  // 21 PIN interrupt flag bit
#define GPIO_FLAG_FLAG20        0x00100000  // 20 PIN interrupt flag bit
#define GPIO_FLAG_FLAG19        0x00080000  // 19 PIN interrupt flag bit
#define GPIO_FLAG_FLAG18        0x00040000  // 18 PIN interrupt flag bit
#define GPIO_FLAG_FLAG17        0x00020000  // 17 PIN interrupt flag bit
#define GPIO_FLAG_FLAG16        0x00010000  // 16 PIN interrupt flag bit
#define GPIO_FLAG_FLAG15        0x00008000  // 15 PIN interrupt flag bit
#define GPIO_FLAG_FLAG14        0x00004000  // 14 PIN interrupt flag bit
#define GPIO_FLAG_FLAG13        0x00002000  // 13 PIN interrupt flag bit
#define GPIO_FLAG_FLAG12        0x00001000  // 12 PIN interrupt flag bit
#define GPIO_FLAG_FLAG11        0x00000800  // 11 PIN interrupt flag bit
#define GPIO_FLAG_FLAG10        0x00000400  // 10 PIN interrupt flag bit
#define GPIO_FLAG_FLAG9         0x00000200  // 9 PIN interrupt flag bit
#define GPIO_FLAG_FLAG8         0x00000100  // 8 PIN interrupt flag bit
#define GPIO_FLAG_FLAG7         0x00000080  // 7 PIN interrupt flag bit
#define GPIO_FLAG_FLAG6         0x00000040  // 6 PIN interrupt flag bit
#define GPIO_FLAG_FLAG5         0x00000020  // 5 PIN interrupt flag bit
#define GPIO_FLAG_FLAG4         0x00000010  // 4 PIN interrupt flag bit
#define GPIO_FLAG_FLAG3         0x00000008  // 3 PIN interrupt flag bit
#define GPIO_FLAG_FLAG2         0x00000004  // 2 PIN interrupt flag bit
#define GPIO_FLAG_FLAG1         0x00000002  // 1 PIN interrupt flag bit
#define GPIO_FLAG_FLAG0         0x00000001  // 0 PIN interrupt flag bit

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_FLAGC register.
//
//*****************************************************************************
#define GPIO_FLAGC_FLAGC31      0x80000000  // 31 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC30      0x40000000  // 30 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC29      0x20000000  // 29 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC28      0x10000000  // 28 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC27      0x08000000  // 27 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC26      0x04000000  // 26 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC25      0x02000000  // 25 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC24      0x01000000  // 24 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC23      0x00800000  // 23 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC22      0x00400000  // 22 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC21      0x00200000  // 21 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC20      0x00100000  // 20 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC19      0x00080000  // 19 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC18      0x00040000  // 18 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC17      0x00020000  // 17 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC16      0x00010000  // 16 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC15      0x00008000  // 15 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC14      0x00004000  // 14 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC13      0x00002000  // 13 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC12      0x00001000  // 12 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC11      0x00000800  // 11 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC10      0x00000400  // 10 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC9       0x00000200  // 9 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC8       0x00000100  // 8 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC7       0x00000080  // 7 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC6       0x00000040  // 6 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC5       0x00000020  // 5 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC4       0x00000010  // 4 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC3       0x00000008  // 3 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC2       0x00000004  // 2 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC1       0x00000002  // 1 PIN interrupt flag bit clear
#define GPIO_FLAGC_FLAGC0       0x00000001  // 0 PIN interrupt flag bit clear

