harviswang/linux-3.10.99/arch/mips/m200/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PEN register.
//
//*****************************************************************************
#define GPIO_PEN_PULL31         0x80000000  // 31 PIN internal pull up or pull down
#define GPIO_PEN_PULL30         0x40000000  // 30 PIN internal pull up or pull down
#define GPIO_PEN_PULL29         0x20000000  // 29 PIN internal pull up or pull down
#define GPIO_PEN_PULL28         0x10000000  // 28 PIN internal pull up or pull down
#define GPIO_PEN_PULL27         0x08000000  // 27 PIN internal pull up or pull down
#define GPIO_PEN_PULL26         0x04000000  // 26 PIN internal pull up or pull down
#define GPIO_PEN_PULL25         0x02000000  // 25 PIN internal pull up or pull down
#define GPIO_PEN_PULL24         0x01000000  // 24 PIN internal pull up or pull down
#define GPIO_PEN_PULL23         0x00800000  // 23 PIN internal pull up or pull down
#define GPIO_PEN_PULL22         0x00400000  // 22 PIN internal pull up or pull down
#define GPIO_PEN_PULL21         0x00200000  // 21 PIN internal pull up or pull down
#define GPIO_PEN_PULL20         0x00100000  // 20 PIN internal pull up or pull down
#define GPIO_PEN_PULL19         0x00080000  // 19 PIN internal pull up or pull down
#define GPIO_PEN_PULL18         0x00040000  // 18 PIN internal pull up or pull down
#define GPIO_PEN_PULL17         0x00020000  // 17 PIN internal pull up or pull down
#define GPIO_PEN_PULL16         0x00010000  // 16 PIN internal pull up or pull down
#define GPIO_PEN_PULL15         0x00008000  // 15 PIN internal pull up or pull down
#define GPIO_PEN_PULL14         0x00004000  // 14 PIN internal pull up or pull down
#define GPIO_PEN_PULL13         0x00002000  // 13 PIN internal pull up or pull down
#define GPIO_PEN_PULL12         0x00001000  // 12 PIN internal pull up or pull down
#define GPIO_PEN_PULL11         0x00000800  // 11 PIN internal pull up or pull down
#define GPIO_PEN_PULL10         0x00000400  // 10 PIN internal pull up or pull down
#define GPIO_PEN_PULL9          0x00000200  // 9 PIN internal pull up or pull down
#define GPIO_PEN_PULL8          0x00000100  // 8 PIN internal pull up or pull down
#define GPIO_PEN_PULL7          0x00000080  // 7 PIN internal pull up or pull down
#define GPIO_PEN_PULL6          0x00000040  // 6 PIN internal pull up or pull down
#define GPIO_PEN_PULL5          0x00000020  // 5 PIN internal pull up or pull down
#define GPIO_PEN_PULL4          0x00000010  // 4 PIN internal pull up or pull down
#define GPIO_PEN_PULL3          0x00000008  // 3 PIN internal pull up or pull down
#define GPIO_PEN_PULL2          0x00000004  // 2 PIN internal pull up or pull down
#define GPIO_PEN_PULL1          0x00000002  // 1 PIN internal pull up or pull down
#define GPIO_PEN_PULL0          0x00000001  // 0 PIN internal pull up or pull down

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PENS register.
//
//*****************************************************************************
#define GPIO_PENS_PULLS31       0x80000000  // 31 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS30       0x40000000  // 30 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS29       0x20000000  // 29 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS28       0x10000000  // 28 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS27       0x08000000  // 27 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS26       0x04000000  // 26 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS25       0x02000000  // 25 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS24       0x01000000  // 24 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS23       0x00800000  // 23 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS22       0x00400000  // 22 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS21       0x00200000  // 21 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS20       0x00100000  // 20 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS19       0x00080000  // 19 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS18       0x00040000  // 18 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS17       0x00020000  // 17 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS16       0x00010000  // 16 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS15       0x00008000  // 15 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS14       0x00004000  // 14 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS13       0x00002000  // 13 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS12       0x00001000  // 12 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS11       0x00000800  // 11 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS10       0x00000400  // 10 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS9        0x00000200  // 9 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS8        0x00000100  // 8 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS7        0x00000080  // 7 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS6        0x00000040  // 6 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS5        0x00000020  // 5 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS4        0x00000010  // 4 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS3        0x00000008  // 3 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS2        0x00000004  // 2 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS1        0x00000002  // 1 PIN internal pull up or pull down set
#define GPIO_PENS_PULLS0        0x00000001  // 0 PIN internal pull up or pull down set

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PENC register.
//
//*****************************************************************************
#define GPIO_PENC_PULLC31       0x80000000  // 31 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC30       0x40000000  // 30 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC29       0x20000000  // 29 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC28       0x10000000  // 28 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC27       0x08000000  // 27 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC26       0x04000000  // 26 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC25       0x02000000  // 25 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC24       0x01000000  // 24 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC23       0x00800000  // 23 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC22       0x00400000  // 22 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC21       0x00200000  // 21 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC20       0x00100000  // 20 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC19       0x00080000  // 19 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC18       0x00040000  // 18 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC17       0x00020000  // 17 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC16       0x00010000  // 16 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC15       0x00008000  // 15 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC14       0x00004000  // 14 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC13       0x00002000  // 13 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC12       0x00001000  // 12 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC11       0x00000800  // 11 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC10       0x00000400  // 10 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC9        0x00000200  // 9 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC8        0x00000100  // 8 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC7        0x00000080  // 7 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC6        0x00000040  // 6 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC5        0x00000020  // 5 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC4        0x00000010  // 4 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC3        0x00000008  // 3 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC2        0x00000004  // 2 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC1        0x00000002  // 1 PIN internal pull up or pull down clear
#define GPIO_PENC_PULLC0        0x00000001  // 0 PIN internal pull up or pull down clear

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_PGZIDLD register.
//
//*****************************************************************************
#define GPIO_GPZIDLD_PORTG      0x00000006  // GPIO Port G load ID
#define GPIO_GPZIDLD_PORTF      0x00000005  // GPIO Port F load ID
#define GPIO_GPZIDLD_PORTE      0x00000004  // GPIO Port E load ID
#define GPIO_GPZIDLD_PORTD      0x00000003  // GPIO Port D load ID
#define GPIO_GPZIDLD_PORTC      0x00000002  // GPIO Port C load ID
#define GPIO_GPZIDLD_PORTB      0x00000001  // GPIO Port B load ID
#define GPIO_GPZIDLD_PORTA      0x00000000  // GPIO Port A load ID

#endif /* __HW_GPIO_H__ */

